#!/usr/bin/env python
# -*- coding: utf8 -*

# 078 두개의 리스트로부터 딕셔너리 생성
#
# date와 end_price라는 두개의 리스트를 daeshin이라는 딕셔너리로 생성하라.
#
# >>> date = ['09/05', '09/06', '09/07', '09/08', '09/09']
# >>> end_price = [10500, 10300, 10100, 10800, 11000]
# 실행 예:
# >>> daeshin
# {'09/09': 11000, '09/08': 10800, '09/06': 10300, '09/05': 10500, '09/07': 10100}
# >>>

date = ['09/05', '09/06', '09/07', '09/08', '09/09']
end_price = [10500, 10300, 10100, 10800, 11000]

daeshine = dict(zip(date, end_price))

print(daeshine)