# 코드는 사람이 이해할 수 있는 말에 가까워 보이지만, 대부분은 컴퓨터를 위한 말입니다.
# 잘 모르는 코드 옆에 메모를 남겨 두면 공부하는 데 도움이 되고,
# 어려운 코드 옆에 설명을 적어 두면 나중에 그 코드를 다시 볼 때 도움이 됩니다.

'''
다중라인 주석은 이렇게도 작성할 수 있습니다.
코드는 사람이 이해할 수 있는 말에 가까워 보이지만, 대부분은 컴퓨터를 위한 말입니다.
잘 모르는 코드 옆에 메모를 남겨 두면 공부하는 데 도움이 되고,
어려운 코드 옆에 설명을 적어 두면 나중에 그 코드를 다시 볼 때 도움이 됩니다.
'''

a = '''다중 문자열
입니다.
주석과 같죠??'''
print(a)

'''
print('안녕! 나는 지구인이야. 나는 다리가 4개 있어.')

print('안녕! 나는', '지구인', '이야. 나는 다리가', 4, '개 있어.')

identity = '지구인'    # 정체를 표시합니다.
number_of_legs = 4      # 다리 갯수

print('안녕! 나는', identity, '이야. 나는 다리가', number_of_legs, '개 있어.')
'''